TGSpock123/STM32_learing.github.io/6_2/HardWare/Encoder.c
#include "stm32f10x.h"

int16_t Encoder_Cot = 0;

void Encoder_Init (void)
{
	RCC_APB2PeriphClockCmd (RCC_APB2Periph_GPIOB, ENABLE);
	RCC_APB2PeriphClockCmd (RCC_APB2Periph_AFIO, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure = 
	{
		GPIO_Pin_0 | GPIO_Pin_1, GPIO_Speed_50MHz, GPIO_Mode_IPU
	};
	
	GPIO_Init (GPIOB, &GPIO_InitStructure);
	
	GPIO_EXTILineConfig (GPIO_PortSourceGPIOB, GPIO_PinSource0);
	GPIO_EXTILineConfig (GPIO_PortSourceGPIOB, GPIO_PinSource1);
	
	EXTI_InitTypeDef EXTI_InitStructure = 
	{
		EXTI_Line0 | EXTI_Line1, EXTI_Mode_Interrupt, EXTI_Trigger_Falling, ENABLE
	};
	
	EXTI_Init (&EXTI_InitStructure);
	
	NVIC_PriorityGroupConfig (NVIC_PriorityGroup_2);
	
	NVIC_InitTypeDef NVIC_InitStructure = 
	{
		EXTI0_IRQn, 1, 1, ENABLE
	};
	
	NVIC_Init (&NVIC_InitStructure);
	
	NVIC_InitStructure.NVIC_IRQChannel = EXTI1_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
	
	NVIC_Init (&NVIC_InitStructure);
}

int16_t Encoder_Get (void)
{
	int16_t temp;
	
	temp = Encoder_Cot;
	Encoder_Cot = 0;
	return temp;
}

//注意他妈的下边那个函数不是EXIT, 菜就复制;
void EXTI0_IRQHandler (void)
{
	if (EXTI_GetITStatus (EXTI_Line0))
	{
		if (!(GPIO_ReadInputDataBit (GPIOB, GPIO_Pin_1)))
		{
			Encoder_Cot --;
		}
		
		EXTI_ClearITPendingBit (EXTI_Line0);
	}
}

void EXTI1_IRQHandler (void)
{
	if (EXTI_GetITStatus (EXTI_Line1))
	{
		if (!(GPIO_ReadInputDataBit (GPIOB, GPIO_Pin_0)))
		{
			Encoder_Cot ++;
		}
		
		EXTI_ClearITPendingBit (EXTI_Line1);
	}
}
